# -*- eval: (setq org-media-note-screenshot-image-dir (concat default-directory "./static/Get property of current headline in Org mode buffer/")); -*-
:PROPERTIES:
:ID:       D0577A57-B452-4A66-A95F-28817756E721
:END:
#+LATEX_CLASS: my-article
#+DATE: <2022-07-30 Sat 13:10>
#+TITLE: Get property of current headline in Org mode buffer
#+ROAM_KEY:
#+PDF_KEY:
#+PAGE_KEY:

#+BEGIN_SRC emacs-lisp :results raw drawer values list :exports no-eval
;; * 第一章  系统和任务分析	1
;; :PROPERTIES:
;; :PDF_KEY: /Users/c/Library/Mobile Documents/iCloud~QReader~MarginStudy/Documents/737/民航安全管理体系实施.pdf
;; :END:

(defconst hurricane--pdf-prop "PDF_KEY"
  "The pdf property string.")

(defconst hurricane--page-prop "PAGE_KEY"
  "The page property string.")

(defun hurricane/headline-property (prop &optional buffer)
  "Return the PDF_KEY property of the current headline in BUFFER."
  (with-current-buffer (or buffer (current-buffer))
    (org-back-to-heading)
    (save-excursion
      (let ((headline (org-element-at-point)))
        (when (and (equal (org-element-type headline) 'headline)
                   (org-entry-get nil prop))
          (org-entry-get nil prop))))))
#+END_SRC

#+RESULTS:
:results:
- hurricane/headline-property
:end:
